{
    "name": "Condition_CNN",
    "layers": [
        {
            "class_name": "InputLayer",
            "config": {
                "batch_input_shape": [
                    null,
                    150,
                    200,
                    3
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "InputImg"
            },
            "name": "InputImg",
            "inbound_nodes": []
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block1_conv1",
                "trainable": false,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block1_conv1",
            "inbound_nodes": [
                [
                    [
                        "InputImg",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization",
            "inbound_nodes": [
                [
                    [
                        "block1_conv1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block1_conv2",
                "trainable": false,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block1_conv2",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_1",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_1",
            "inbound_nodes": [
                [
                    [
                        "block1_conv2",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "name": "block1_pool",
                "trainable": false,
                "dtype": "float32",
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last"
            },
            "name": "block1_pool",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block2_conv1",
                "trainable": false,
                "dtype": "float32",
                "filters": 128,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block2_conv1",
            "inbound_nodes": [
                [
                    [
                        "block1_pool",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_2",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_2",
            "inbound_nodes": [
                [
                    [
                        "block2_conv1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block2_conv2",
                "trainable": false,
                "dtype": "float32",
                "filters": 128,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block2_conv2",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_2",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_3",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_3",
            "inbound_nodes": [
                [
                    [
                        "block2_conv2",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "name": "block2_pool",
                "trainable": false,
                "dtype": "float32",
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last"
            },
            "name": "block2_pool",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_3",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block3_conv1",
                "trainable": false,
                "dtype": "float32",
                "filters": 256,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block3_conv1",
            "inbound_nodes": [
                [
                    [
                        "block2_pool",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_4",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_4",
            "inbound_nodes": [
                [
                    [
                        "block3_conv1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block3_conv2",
                "trainable": false,
                "dtype": "float32",
                "filters": 256,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block3_conv2",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_4",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_5",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_5",
            "inbound_nodes": [
                [
                    [
                        "block3_conv2",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "name": "block3_pool",
                "trainable": false,
                "dtype": "float32",
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last"
            },
            "name": "block3_pool",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_5",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block4_conv1",
                "trainable": false,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block4_conv1",
            "inbound_nodes": [
                [
                    [
                        "block3_pool",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_6",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_6",
            "inbound_nodes": [
                [
                    [
                        "block4_conv1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block4_conv2",
                "trainable": false,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block4_conv2",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_6",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_7",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_7",
            "inbound_nodes": [
                [
                    [
                        "block4_conv2",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "name": "block4_pool",
                "trainable": false,
                "dtype": "float32",
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last"
            },
            "name": "block4_pool",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_7",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block5_conv1_sub",
                "trainable": false,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block5_conv1_sub",
            "inbound_nodes": [
                [
                    [
                        "block4_pool",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_13",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_13",
            "inbound_nodes": [
                [
                    [
                        "block5_conv1_sub",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block5_conv1_mas",
                "trainable": false,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block5_conv1_mas",
            "inbound_nodes": [
                [
                    [
                        "block4_pool",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block5_conv2_sub",
                "trainable": false,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block5_conv2_sub",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_13",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_8",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_8",
            "inbound_nodes": [
                [
                    [
                        "block5_conv1_mas",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_14",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_14",
            "inbound_nodes": [
                [
                    [
                        "block5_conv2_sub",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block5_conv2_mas",
                "trainable": false,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block5_conv2_mas",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_8",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block5_conv3_sub",
                "trainable": false,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block5_conv3_sub",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_14",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_9",
                "trainable": false,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_9",
            "inbound_nodes": [
                [
                    [
                        "block5_conv2_mas",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_15",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_15",
            "inbound_nodes": [
                [
                    [
                        "block5_conv3_sub",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "name": "block5_conv3_mas",
                "trainable": true,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "block5_conv3_mas",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_9",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Flatten",
            "config": {
                "name": "c2_flatten",
                "trainable": true,
                "dtype": "float32",
                "data_format": "channels_last"
            },
            "name": "c2_flatten",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_15",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_10",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    3
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_10",
            "inbound_nodes": [
                [
                    [
                        "block5_conv3_mas",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dense",
            "config": {
                "name": "c2_fc_sub",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "c2_fc_sub",
            "inbound_nodes": [
                [
                    [
                        "c2_flatten",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Flatten",
            "config": {
                "name": "c1_flatten",
                "trainable": true,
                "dtype": "float32",
                "data_format": "channels_last"
            },
            "name": "c1_flatten",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_10",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_16",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    1
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_16",
            "inbound_nodes": [
                [
                    [
                        "c2_fc_sub",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dense",
            "config": {
                "name": "c1_fc_mas",
                "trainable": true,
                "dtype": "float32",
                "units": 256,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "c1_fc_mas",
            "inbound_nodes": [
